run_cases/case04_singleGaussianWaveWithShock/0.orig/linearZone/pPrime
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/linearZone";
    object      pPrime;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   #codeStream
{
	codeInclude
    #{
        #include "fvCFD.H"
    #};
    
    codeOptions
    #{
        -I$(LIB_SRC)/finiteVolume/lnInclude \
        -I$(LIB_SRC)/meshTools/lnInclude \
        -I$(FOAM_CASE)/0/
    #};

    code
    #{
        const IOdictionary& d = static_cast<const IOdictionary&>(dict);

        const fvMesh& mesh = refCast<const fvMesh>(d.db());
        
		#include "waveProperties.H"

		// Pressure perturbation
		const scalar pPrime(ep);

		scalarField p(mesh.nCells(), 0.0*pMean*TMean);

        forAll(p, i)
        {
			const vector& xc = mesh.C().internalField()[i];

			const scalar rp = (xc - xp) & kp;

			p[i] += pPrime*Foam::exp(-ap*sqr(rp));
			//p[i] += pPrime*(rp < 0.0 ? 1.0 : Foam::exp(-ap*sqr(rp)));
        }

		p.writeEntry("", os);
	#};
};

#include "boundaryFile"

// ************************************************************************* //
